app/controllers/school_classes_controller.rb

SELECT "school_classes".* FROM "school_classes"
---
    def index
        @school_classs = SchoolClass.all

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-06-24 20:03:39.692254"], ["updated_at", "2019-06-24 20:03:39.692254"]]
---
    def create
        @school_class = SchoolClass.create(title: params["school_class"]["title"], room_number: params["school_class"]["room_number"])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @school_class = SchoolClass.find_by(id: params["id"])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @school_class = SchoolClass.find_by(id: params["id"])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-06-24 20:11:01.325911"], ["id", 1]]
---
    def update
        @school_class = SchoolClass.find_by(id: params["id"])
        @school_class.update(title: params["school_class"]["title"], room_number: params["school_class"]["room_number"])